---
kind: method
id: M:Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.GetParentHwnd
source: html/aab86ff2-d119-c35d-1cdd-773287c4be63.htm
---
# Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.GetParentHwnd Method

return the parent handle

## Syntax (C#)
```csharp
public IntPtr GetParentHwnd()
```